pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_uicr.h
/*
 * Copyright (c) 2023 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_UICR_H_
#define NRF_UICR_H_

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_uicr_hal UICR HAL
 * @{
 * @ingroup nrf_icr
 * @brief   Hardware access layer for managing the User Information Configuration Registers (UICR) peripheral.
 */

#if defined(UICR_MEM_CONFIG_READ_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether memory configuration through UICR is present. */
#define NRF_UICR_HAS_MEM_CONFIG 1
#else
#define NRF_UICR_HAS_MEM_CONFIG 0
#endif

#if defined(UICR_PERIPH_CONFIG_PROCESSOR_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether peripheral configuration through UICR is present. */
#define NRF_UICR_HAS_PERIPH_CONFIG 1
#else
#define NRF_UICR_HAS_PERIPH_CONFIG 0
#endif

#if defined(UICR_GRTC_CC_OWN_CC0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether feature configuration through UICR is present. */
#define NRF_UICR_HAS_FEATURE_CONFIG 1
#else
#define NRF_UICR_HAS_FEATURE_CONFIG 0
#endif

#if defined(UICR_MAILBOX_CONFIG_SIZE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether mailbox configuration through UICR is present. */
#define NRF_UICR_HAS_MAILBOX 1
#else
#define NRF_UICR_HAS_MAILBOX 0
#endif

#if defined(UICR_INITSVTOR_INITSVTOR_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether VTOR configuration through UICR is present. */
#define NRF_UICR_HAS_VTOR 1
#else
#define NRF_UICR_HAS_VTOR 0
#endif

#if defined(UICR_PTREXTUICR_PTREXTUICR_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether extended UICR is present. */
#define NRF_UICR_HAS_PTREXT 1
#else
#define NRF_UICR_HAS_PTREXT 0
#endif

#if defined(UICREXTENDED_GPIO_OWN_PIN0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GPIO feature is present. */
#define NRF_UICR_HAS_FEATURE_GPIO 1
#else
#define NRF_UICR_HAS_FEATURE_GPIO 0
#endif

#if defined(UICR_BOOTCONF_READ_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether immutable boot region configuration is present. */
#define NRF_UICR_HAS_BOOTCONF 1
#else
#define NRF_UICR_HAS_BOOTCONF 0
#endif

#if (defined(UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Msk) & \
    defined(UICR_DPPI_GLOBAL_CH_LINK_EN_CH0_Msk)) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Symbol indicating whether linking channels of DPPI as either source or sink is configured
 *        using the LINK.DIR and LINK.EN registers.
 */
#define NRF_UICR_HAS_CH_LINK_DIR_EN 1
#else
#define NRF_UICR_HAS_CH_LINK_DIR_EN 0
#endif

/** @brief Number of memory blocks. */
#define NRF_UICR_MEM_COUNT         UICR_MEM_MaxCount

/** @brief Number of peripherals. */
#define NRF_UICR_PERIPH_COUNT      UICR_PERIPH_MaxCount

#if NRF_UICR_HAS_FEATURE_GPIO
/** @brief Number of GPIOs. */
#define NRF_UICR_GPIO_COUNT        UICREXTENDED_GPIO_MaxCount
#endif

/** @brief Number of GPIOTE channels. */
#define NRF_UICR_GPIOTE_CH_COUNT   UICR_GPIOTE_MaxCount

/** @brief Number of global IPCTs. */
#define NRF_UICR_IPCT_GLOBAL_COUNT UICR_IPCT_GLOBAL_MaxCount

/** @brief Number of local IPCTs. */
#define NRF_UICR_DPPI_LOCAL_COUNT  UICR_DPPI_LOCAL_MaxCount

/** @brief Number of global DPPIs. */
#define NRF_UICR_DPPI_GLOBAL_COUNT UICR_DPPI_GLOBAL_MaxCount

/** @brief Number of IPCMAPs. */
#define NRF_UICR_IPCMAP_COUNT      UICR_IPCMAP_MaxCount

/** @brief Number of MAILBOXes. */
#define NRF_UICR_MAILBOX_COUNT     UICR_MAILBOX_MaxCount

/** @brief Immutable boot region permissions bitmask. */
#define NRF_UICR_BOOTCONF_PERM_MASK (UICR_BOOTCONF_READ_Msk | UICR_BOOTCONF_WRITE_Msk | \
                                     UICR_BOOTCONF_EXECUTE_Msk | UICR_BOOTCONF_SECURE_Msk)

#if NRF_UICR_HAS_MEM_CONFIG
/**
 * @brief Memory permissions mask.
 *
 * @note When bit is set, the selected action is not allowed.
 */
typedef enum
{
    NRF_UICR_MEM_CONFIG_PERM_READ_MASK      = UICR_MEM_CONFIG_READ_Msk,
    NRF_UICR_MEM_CONFIG_PERM_WRITE_MASK     = UICR_MEM_CONFIG_WRITE_Msk,
    NRF_UICR_MEM_CONFIG_PERM_EXECUTE_MASK   = UICR_MEM_CONFIG_EXECUTE_Msk,
    NRF_UICR_MEM_CONFIG_PERM_NONSECURE_MASK = UICR_MEM_CONFIG_SECURE_Msk,
} nrf_uicr_mem_config_perm_mask_t;

/** @brief Memory configuration. */
typedef struct
{
    uint32_t    permissions;
    nrf_owner_t owner;
    uint32_t    address;
} nrf_uicr_mem_config_t;
#endif

#if NRF_UICR_HAS_FEATURE_CONFIG
/**
 * @brief Feature index mask.
 *
 * @note Ownership of the pin is indicated by bit not set.
 */
typedef enum
{
    NRF_UICR_FEATURE_INDEX_0_MASK  = UICR_GPIOTE_CH_OWN_CH0_Msk,
    NRF_UICR_FEATURE_INDEX_1_MASK  = UICR_GPIOTE_CH_OWN_CH1_Msk,
    NRF_UICR_FEATURE_INDEX_2_MASK  = UICR_GPIOTE_CH_OWN_CH2_Msk,
    NRF_UICR_FEATURE_INDEX_3_MASK  = UICR_GPIOTE_CH_OWN_CH3_Msk,
    NRF_UICR_FEATURE_INDEX_4_MASK  = UICR_GPIOTE_CH_OWN_CH4_Msk,
    NRF_UICR_FEATURE_INDEX_5_MASK  = UICR_GPIOTE_CH_OWN_CH5_Msk,
    NRF_UICR_FEATURE_INDEX_6_MASK  = UICR_GPIOTE_CH_OWN_CH6_Msk,
    NRF_UICR_FEATURE_INDEX_7_MASK  = UICR_GPIOTE_CH_OWN_CH7_Msk,
    NRF_UICR_FEATURE_INDEX_8_MASK  = UICR_GPIOTE_CH_OWN_CH8_Msk,
    NRF_UICR_FEATURE_INDEX_9_MASK  = UICR_GPIOTE_CH_OWN_CH9_Msk,
    NRF_UICR_FEATURE_INDEX_10_MASK = UICR_GPIOTE_CH_OWN_CH10_Msk,
    NRF_UICR_FEATURE_INDEX_11_MASK = UICR_GPIOTE_CH_OWN_CH11_Msk,
    NRF_UICR_FEATURE_INDEX_12_MASK = UICR_GPIOTE_CH_OWN_CH12_Msk,
    NRF_UICR_FEATURE_INDEX_13_MASK = UICR_GPIOTE_CH_OWN_CH13_Msk,
    NRF_UICR_FEATURE_INDEX_14_MASK = UICR_GPIOTE_CH_OWN_CH14_Msk,
    NRF_UICR_FEATURE_INDEX_15_MASK = UICR_GPIOTE_CH_OWN_CH15_Msk,
    NRF_UICR_FEATURE_INDEX_16_MASK = UICR_GPIOTE_CH_OWN_CH16_Msk,
    NRF_UICR_FEATURE_INDEX_17_MASK = UICR_GPIOTE_CH_OWN_CH17_Msk,
    NRF_UICR_FEATURE_INDEX_18_MASK = UICR_GPIOTE_CH_OWN_CH18_Msk,
    NRF_UICR_FEATURE_INDEX_19_MASK = UICR_GPIOTE_CH_OWN_CH19_Msk,
    NRF_UICR_FEATURE_INDEX_20_MASK = UICR_GPIOTE_CH_OWN_CH20_Msk,
    NRF_UICR_FEATURE_INDEX_21_MASK = UICR_GPIOTE_CH_OWN_CH21_Msk,
    NRF_UICR_FEATURE_INDEX_22_MASK = UICR_GPIOTE_CH_OWN_CH22_Msk,
    NRF_UICR_FEATURE_INDEX_23_MASK = UICR_GPIOTE_CH_OWN_CH23_Msk,
    NRF_UICR_FEATURE_INDEX_24_MASK = UICR_GPIOTE_CH_OWN_CH24_Msk,
    NRF_UICR_FEATURE_INDEX_25_MASK = UICR_GPIOTE_CH_OWN_CH25_Msk,
    NRF_UICR_FEATURE_INDEX_26_MASK = UICR_GPIOTE_CH_OWN_CH26_Msk,
    NRF_UICR_FEATURE_INDEX_27_MASK = UICR_GPIOTE_CH_OWN_CH27_Msk,
    NRF_UICR_FEATURE_INDEX_28_MASK = UICR_GPIOTE_CH_OWN_CH28_Msk,
    NRF_UICR_FEATURE_INDEX_29_MASK = UICR_GPIOTE_CH_OWN_CH29_Msk,
    NRF_UICR_FEATURE_INDEX_30_MASK = UICR_GPIOTE_CH_OWN_CH30_Msk,
    NRF_UICR_FEATURE_INDEX_31_MASK = UICR_GPIOTE_CH_OWN_CH31_Msk,
} nrf_uicr_feature_index_mask_t;

/** @brief UICR features. */
typedef enum
{
    NRF_UICR_FEATURE_GPIO,
    NRF_UICR_FEATURE_GPIOTE_CH,
    NRF_UICR_FEATURE_IPCT_LOCAL_CH,
    NRF_UICR_FEATURE_IPCT_LOCAL_INTERRUPT,
    NRF_UICR_FEATURE_IPCT_GLOBAL_CH,
    NRF_UICR_FEATURE_IPCT_GLOBAL_INTERRUPT,
    NRF_UICR_FEATURE_DPPI_LOCAL_CH,
    NRF_UICR_FEATURE_DPPI_LOCAL_CHG,
    NRF_UICR_FEATURE_DPPI_GLOBAL_CH,
    NRF_UICR_FEATURE_DPPI_GLOBAL_CHG,
    NRF_UICR_FEATURE_GRTC_CC,
} nrf_uicr_feature_t;

/** @brief IPCMAP pair. */
typedef struct
{
    uint8_t      ipct_channel;
    nrf_domain_t domain;
} nrf_uicr_ipcmap_pair_t;

/** @brief IPCMAP configuration. */
typedef struct
{
    nrf_uicr_ipcmap_pair_t source;
    nrf_uicr_ipcmap_pair_t sink;
} nrf_uicr_ipcmap_config_t;

