pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_uicr.h
/** @brief DPPI link. */
typedef struct
{
    uint32_t source;
    uint32_t sink;
} nrf_uicr_dppi_link_t;
#endif // NRF_UICR_HAS_FEATURE_CONFIG

#if NRF_UICR_HAS_PERIPH_CONFIG
/** @brief Peripheral configuration. */
typedef struct
{
    bool            secattr;
    bool            dmasec;
    nrf_processor_t processor;
    uint32_t        address;
} nrf_uicr_periph_config_t;
#endif

#if NRF_UICR_HAS_MAILBOX
/** @brief MAILBOX configuration. */
typedef struct
{
    uint16_t    size;
    nrf_owner_t owner;
    bool        secure;
} nrf_uicr_mailbox_config_t;
#endif

#if NRF_UICR_HAS_BOOTCONF
/**
 * @brief Immutable boot region permissions mask.
 *
 * @note When bit is set, the selected action is allowed.
 */
typedef enum
{
    NRF_UICR_BOOT_REGION_PERM_READ_MASK    = UICR_BOOTCONF_READ_Msk,    ///< Read access.
    NRF_UICR_BOOT_REGION_PERM_WRITE_MASK   = UICR_BOOTCONF_WRITE_Msk,   ///< Write access.
    NRF_UICR_BOOT_REGION_PERM_EXECUTE_MASK = UICR_BOOTCONF_EXECUTE_Msk, ///< Software execute.
    NRF_UICR_BOOT_REGION_PERM_SECURE_MASK  = UICR_BOOTCONF_SECURE_Msk,  ///< Secure-only access.
} nrf_uicr_boot_region_perm_mask_t;

/** @brief Immutable boot region configuration. */
typedef struct
{
    uint32_t permissions; ///< Permissions created using @ref nrf_uicr_boot_region_perm_mask_t.
    bool     writeonce;   ///< True if writes to the boot region are to be applied only when the current data is 0xFFFFFFFF.
    bool     lock;        ///< True if RRAMC configuration registers for the boot region are to be read-only.
    uint16_t size_kb;     ///< Region size in kBs. */
} nrf_uicr_boot_region_config_t;
#endif

#if NRF_UICR_HAS_MEM_CONFIG
/**
 * @brief Function for getting the configuration of the memory block.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the memory block.
 *
 * @return Configuration of the specified memory block.
 */
NRF_STATIC_INLINE nrf_uicr_mem_config_t nrf_uicr_mem_config_get(NRF_UICR_Type const * p_reg,
                                                                uint8_t               index);

/**
 * @brief Function for getting the size of the memory block.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the memory block.
 *
 * @return Size of the specified memory block in bytes.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_mem_size_get(NRF_UICR_Type const * p_reg, uint8_t index);
#endif

#if NRF_UICR_HAS_PERIPH_CONFIG
/**
 * @brief Function for getting the configuration of the peripheral.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the peripheral.
 *
 * @return Configuration of the specified peripheral.
 */
NRF_STATIC_INLINE nrf_uicr_periph_config_t nrf_uicr_periph_config_get(NRF_UICR_Type const * p_reg,
                                                                      uint8_t               index);
#endif

#if NRF_UICR_HAS_FEATURE_CONFIG
/**
 * @brief Function for getting the ownership requests of the feature.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] feature Feature to be accessed.
 * @param[in] index   Index of the feature. Only used for applicable features, otherwise skipped.
 *
 * @return Ownership requests mask of the specified feature.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_feature_own_get(NRF_UICR_Type const * p_reg,
                                                    nrf_uicr_feature_t    feature,
                                                    uint8_t               index);

/**
 * @brief Function for getting the permission requests of the feature.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] feature Feature to be accessed.
 * @param[in] index   Index of the feature. Only used for applicable features, otherwise skipped.
 *
 * @return Permission requests mask of the specified feature.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_feature_secure_get(NRF_UICR_Type const * p_reg,
                                                       nrf_uicr_feature_t    feature,
                                                       uint8_t               index);

/**
 * @brief Function for getting the linking requests of the feature.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] feature Feature to be accessed.
 * @param[in] index   Index of the feature. Only used for applicable features, otherwise skipped.
 *
 * @return Linking requests masks for source and sink of the specified feature.
 */
NRF_STATIC_INLINE nrf_uicr_dppi_link_t nrf_uicr_feature_link_get(NRF_UICR_Type const * p_reg,
                                                                 nrf_uicr_feature_t    feature,
                                                                 uint8_t               index);

/**
 * @brief Function for getting the configuration of the IPCMAP channel.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the IPCMAP channel.
 *
 * @return Configuration of the specified IPCMAP channel.
 */
NRF_STATIC_INLINE nrf_uicr_ipcmap_config_t nrf_uicr_ipcmap_config_get(NRF_UICR_Type const * p_reg,
                                                                      uint8_t               index);
#endif

#if NRF_UICR_HAS_MAILBOX
/**
 * @brief Function for getting the address of the MAILBOX.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the memory block.
 *
 * @return Start address of the specified MAILBOX.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_mailbox_address_get(NRF_UICR_Type const * p_reg, uint8_t index);

/**
 * @brief Function for getting the configuration of the MAILBOX.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of the MAILBOX.
 *
 * @return Configuration of the specified MAILBOX.
 */
NRF_STATIC_INLINE
nrf_uicr_mailbox_config_t nrf_uicr_mailbox_config_get(NRF_UICR_Type const * p_reg,
                                                      uint8_t               index);
#endif

#if NRF_UICR_HAS_VTOR
/**
 * @brief Function for getting the initial value of the secure VTOR (Vector Table Offset Register).
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Initial value of the secure VTOR.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_initsvtor_get(NRF_UICR_Type const * p_reg);

/**
 * @brief Function for getting the initial value of the non-secure VTOR.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Initial value of the non-secure VTOR.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_initnsvtor_get(NRF_UICR_Type const * p_reg);
#endif

#if NRF_UICR_HAS_PTREXT
/**
 * @brief Function for getting the pointer to the extended UICR.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Pointer to the extended UICR.
 */
NRF_STATIC_INLINE uint32_t * nrf_uicr_ptrextuicr_get(NRF_UICR_Type const * p_reg);
#endif

