pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_uicr.h
#if NRF_UICR_HAS_BOOTCONF
/**
 * @brief Function for setting the configuration of the immutable boot region.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] p_config Pointer to the configuration structure.
 */
NRF_STATIC_INLINE
void nrf_uicr_boot_region_config_set(NRF_UICR_Type *                       p_reg,
                                     nrf_uicr_boot_region_config_t const * p_config);

/**
 * @brief Function for getting the configuration of the immutable boot region.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] p_config Pointer to the structure to be filled with immutable boot region settings.
 *
 * @retval true  Configuration is applied.
 * @retval false Register is equal to 0xFFFFFFFF, meaning that configuration is not applied.
 */
NRF_STATIC_INLINE bool nrf_uicr_boot_region_config_get(NRF_UICR_Type const *           p_reg,
                                                       nrf_uicr_boot_region_config_t * p_config);
#endif

#if NRF_UICR_HAS_FEATURE_GPIO
/**
 * @brief Function for getting the GPIO instance address associated with the specified GPIO entry.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of GPIO entry.
 *
 * @return GPIO instance address.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_gpio_instance_get(NRF_UICREXTENDED_Type const * p_reg,
                                                      uint8_t                       index);

/**
 * @brief Function for getting the CTRLSEL configuration associated with the specified GPIO pin.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] pin_number Absolute pin number.
 *
 * @return CTRLSEL configuration.
 */
NRF_STATIC_INLINE uint32_t nrf_uicr_gpio_ctrlsel_get(NRF_UICREXTENDED_Type const * p_reg,
                                                     uint32_t                      pin_number);
#endif

#ifndef NRF_DECLARE_ONLY

#if NRF_UICR_HAS_MEM_CONFIG
NRF_STATIC_INLINE nrf_uicr_mem_config_t nrf_uicr_mem_config_get(NRF_UICR_Type const * p_reg,
                                                                uint8_t               index)
{
    NRFX_ASSERT(index < NRF_UICR_MEM_COUNT);
    nrf_uicr_mem_config_t config;

    config.permissions = (p_reg->MEM[index].CONFIG &
                          (UICR_MEM_CONFIG_READ_Msk | UICR_MEM_CONFIG_WRITE_Msk |
                           UICR_MEM_CONFIG_EXECUTE_Msk | UICR_MEM_CONFIG_SECURE_Msk)
                          >> UICR_MEM_CONFIG_READ_Pos);

    config.owner = (nrf_owner_t)((p_reg->MEM[index].CONFIG & UICR_MEM_CONFIG_OWNERID_Msk) >>
                                 UICR_MEM_CONFIG_OWNERID_Pos);

    /* Address should not be bit-shifted, as it contains bits [31:12]. The rest should be all zeroes. */
    config.address = (p_reg->MEM[index].CONFIG & UICR_MEM_CONFIG_ADDRESS_Msk);

    return config;
}

NRF_STATIC_INLINE uint32_t nrf_uicr_mem_size_get(NRF_UICR_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_UICR_MEM_COUNT);
    return p_reg->MEM[index].SIZE;
}
#endif

#if NRF_UICR_HAS_PERIPH_CONFIG
NRF_STATIC_INLINE nrf_uicr_periph_config_t nrf_uicr_periph_config_get(NRF_UICR_Type const * p_reg,
                                                                      uint8_t               index)
{
    NRFX_ASSERT(index < NRF_UICR_PERIPH_COUNT);
    nrf_uicr_periph_config_t config;

    config.secattr = (p_reg->PERIPH[index].CONFIG & UICR_PERIPH_CONFIG_SECURE_Msk) >>
                     UICR_PERIPH_CONFIG_SECURE_Pos;

    config.dmasec = (p_reg->PERIPH[index].CONFIG & UICR_PERIPH_CONFIG_DMASEC_Msk) >>
                    UICR_PERIPH_CONFIG_DMASEC_Pos;

    config.processor = (nrf_processor_t)((p_reg->PERIPH[index].CONFIG & UICR_PERIPH_CONFIG_PROCESSOR_Msk)
                                         >> UICR_PERIPH_CONFIG_PROCESSOR_Pos);

    /* Address should not be bit-shifted, as it contains bits [31:12]. The rest should be all zeroes. */
    config.address = (p_reg->PERIPH[index].CONFIG & UICR_PERIPH_CONFIG_ADDRESS_Msk);

    return config;
}
#endif

#if NRF_UICR_HAS_FEATURE_CONFIG
NRF_STATIC_INLINE uint32_t nrf_uicr_feature_own_get(NRF_UICR_Type const * p_reg,
                                                    nrf_uicr_feature_t    feature,
                                                    uint8_t               index)
{
    switch (feature)
    {
#if NRF_UICR_HAS_FEATURE_GPIO
        case NRF_UICR_FEATURE_GPIO:
            NRFX_ASSERT(index < NRF_UICR_GPIO_COUNT);
            return ((NRF_UICREXTENDED_Type *)nrf_uicr_ptrextuicr_get(p_reg))->GPIO[index].OWN;
#endif

        case NRF_UICR_FEATURE_GPIOTE_CH:
            NRFX_ASSERT(index < NRF_UICR_GPIOTE_CH_COUNT);
            return p_reg->GPIOTE[index].CH.OWN;

        case NRF_UICR_FEATURE_IPCT_GLOBAL_CH:
            NRFX_ASSERT(index < NRF_UICR_IPCT_GLOBAL_COUNT);
            return p_reg->IPCT.GLOBAL[index].CH.OWN;

        case NRF_UICR_FEATURE_IPCT_GLOBAL_INTERRUPT:
            NRFX_ASSERT(index < NRF_UICR_IPCT_GLOBAL_COUNT);
            return p_reg->IPCT.GLOBAL[index].INTERRUPT.OWN;

        case NRF_UICR_FEATURE_DPPI_GLOBAL_CH:
            NRFX_ASSERT(index < NRF_UICR_DPPI_GLOBAL_COUNT);
            return p_reg->DPPI.GLOBAL[index].CH.OWN;

        case NRF_UICR_FEATURE_DPPI_GLOBAL_CHG:
            NRFX_ASSERT(index < NRF_UICR_DPPI_GLOBAL_COUNT);
            return p_reg->DPPI.GLOBAL[index].CHG.OWN;

        case NRF_UICR_FEATURE_GRTC_CC:
            return p_reg->GRTC.CC.OWN;

        default:
            NRFX_ASSERT(false);
            return 0;
    }
}

NRF_STATIC_INLINE uint32_t nrf_uicr_feature_secure_get(NRF_UICR_Type const * p_reg,
                                                       nrf_uicr_feature_t    feature,
                                                       uint8_t               index)
{
    switch (feature)
    {
#if NRF_UICR_HAS_FEATURE_GPIO
        case NRF_UICR_FEATURE_GPIO:
            NRFX_ASSERT(index < NRF_UICR_GPIO_COUNT);
            return ((NRF_UICREXTENDED_Type *)nrf_uicr_ptrextuicr_get(p_reg))->GPIO[index].SECURE;
#endif

        case NRF_UICR_FEATURE_GPIOTE_CH:
            NRFX_ASSERT(index < NRF_UICR_GPIOTE_CH_COUNT);
            return p_reg->GPIOTE[index].CH.SECURE;

        case NRF_UICR_FEATURE_IPCT_LOCAL_CH:
            return p_reg->IPCT.LOCAL.CH.SECURE;

