pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_uicr.h
        case NRF_UICR_FEATURE_IPCT_LOCAL_INTERRUPT:
            return p_reg->IPCT.LOCAL.INTERRUPT.SECURE;

        case NRF_UICR_FEATURE_IPCT_GLOBAL_CH:
            NRFX_ASSERT(index < NRF_UICR_IPCT_GLOBAL_COUNT);
            return p_reg->IPCT.GLOBAL[index].CH.SECURE;

        case NRF_UICR_FEATURE_IPCT_GLOBAL_INTERRUPT:
            NRFX_ASSERT(index < NRF_UICR_IPCT_GLOBAL_COUNT);
            return p_reg->IPCT.GLOBAL[index].INTERRUPT.SECURE;

        case NRF_UICR_FEATURE_DPPI_LOCAL_CH:
            NRFX_ASSERT(index < NRF_UICR_DPPI_LOCAL_COUNT);
            return p_reg->DPPI.LOCAL[index].CH.SECURE;

        case NRF_UICR_FEATURE_DPPI_LOCAL_CHG:
            NRFX_ASSERT(index < NRF_UICR_DPPI_LOCAL_COUNT);
            return p_reg->DPPI.LOCAL[index].CHG.SECURE;

        case NRF_UICR_FEATURE_DPPI_GLOBAL_CH:
            NRFX_ASSERT(index < NRF_UICR_DPPI_GLOBAL_COUNT);
            return p_reg->DPPI.GLOBAL[index].CH.SECURE;

        case NRF_UICR_FEATURE_DPPI_GLOBAL_CHG:
            NRFX_ASSERT(index < NRF_UICR_DPPI_GLOBAL_COUNT);
            return p_reg->DPPI.GLOBAL[index].CHG.SECURE;

        case NRF_UICR_FEATURE_GRTC_CC:
            return p_reg->GRTC.CC.SECURE;

        default:
            NRFX_ASSERT(false);
            return 0;
    }
}

NRF_STATIC_INLINE nrf_uicr_dppi_link_t nrf_uicr_feature_link_get(NRF_UICR_Type const * p_reg,
                                                                 nrf_uicr_feature_t    feature,
                                                                 uint8_t               index)
{
    nrf_uicr_dppi_link_t link;

    switch (feature)
    {
        case NRF_UICR_FEATURE_DPPI_LOCAL_CH:
            NRFX_ASSERT(index < NRF_UICR_DPPI_LOCAL_COUNT);
#if NRF_UICR_HAS_CH_LINK_DIR_EN
            link.source = p_reg->DPPI.LOCAL[index].CH.LINK.EN | ~p_reg->DPPI.LOCAL[index].CH.LINK.DIR;
            link.sink = p_reg->DPPI.LOCAL[index].CH.LINK.EN | p_reg->DPPI.LOCAL[index].CH.LINK.DIR;
#else
            link.source = p_reg->DPPI.LOCAL[index].CH.LINK.SOURCE;
            link.sink = p_reg->DPPI.LOCAL[index].CH.LINK.SINK;
#endif
            break;

        case NRF_UICR_FEATURE_DPPI_GLOBAL_CH:
            NRFX_ASSERT(index < NRF_UICR_DPPI_GLOBAL_COUNT);
#if NRF_UICR_HAS_CH_LINK_DIR_EN
            link.source = p_reg->DPPI.GLOBAL[index].CH.LINK.EN | ~p_reg->DPPI.GLOBAL[index].CH.LINK.DIR;
            link.sink = p_reg->DPPI.GLOBAL[index].CH.LINK.EN | p_reg->DPPI.GLOBAL[index].CH.LINK.DIR;
#else
            link.source = p_reg->DPPI.GLOBAL[index].CH.LINK.SOURCE;
            link.sink = p_reg->DPPI.GLOBAL[index].CH.LINK.SINK;
#endif
            break;

        default:
            NRFX_ASSERT(false);
            break;
    }

    return link;
}

NRF_STATIC_INLINE nrf_uicr_ipcmap_config_t nrf_uicr_ipcmap_config_get(NRF_UICR_Type const * p_reg,
                                                                      uint8_t               index)
{
    NRFX_ASSERT(index < NRF_UICR_IPCMAP_COUNT);
    nrf_uicr_ipcmap_config_t map;

    map.source.ipct_channel = (p_reg->IPCMAP[index] & UICR_IPCMAP_IPCTCHSOURCE_Msk)
                              >> UICR_IPCMAP_IPCTCHSOURCE_Pos;

    map.source.domain = (nrf_domain_t)((p_reg->IPCMAP[index] & UICR_IPCMAP_DOMAINIDSOURCE_Msk)
                                       >> UICR_IPCMAP_DOMAINIDSOURCE_Pos);

    map.sink.ipct_channel = (p_reg->IPCMAP[index] & UICR_IPCMAP_IPCTCHSINK_Msk)
                            >> UICR_IPCMAP_IPCTCHSINK_Pos;

    map.sink.domain = (nrf_domain_t)((p_reg->IPCMAP[index] & UICR_IPCMAP_DOMAINIDSINK_Msk)
                                     >> UICR_IPCMAP_DOMAINIDSINK_Pos);

    return map;
}
#endif

#if NRF_UICR_HAS_MAILBOX
NRF_STATIC_INLINE uint32_t nrf_uicr_mailbox_address_get(NRF_UICR_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_UICR_MAILBOX_COUNT);

    return p_reg->MAILBOX[index].ADDRESS;
}

NRF_STATIC_INLINE
nrf_uicr_mailbox_config_t nrf_uicr_mailbox_config_get(NRF_UICR_Type const * p_reg,
                                                      uint8_t               index)
{
    NRFX_ASSERT(index < NRF_UICR_MAILBOX_COUNT);
    nrf_uicr_mailbox_config_t config;

    config.size = (p_reg->MAILBOX[index].CONFIG & UICR_MAILBOX_CONFIG_SIZE_Msk)
                  >> UICR_MAILBOX_CONFIG_SIZE_Pos;

    config.owner = (nrf_owner_t)((p_reg->MAILBOX[index].CONFIG & UICR_MAILBOX_CONFIG_OWNERID_Msk)
                                 >> UICR_MAILBOX_CONFIG_OWNERID_Pos);

    config.secure = (p_reg->MAILBOX[index].CONFIG & UICR_MAILBOX_CONFIG_SECURE_Msk)
                    >> UICR_MAILBOX_CONFIG_SECURE_Pos;

    return config;
}
#endif

#if NRF_UICR_HAS_VTOR
NRF_STATIC_INLINE uint32_t nrf_uicr_initsvtor_get(NRF_UICR_Type const * p_reg)
{
    return p_reg->INITSVTOR;
}

NRF_STATIC_INLINE uint32_t nrf_uicr_initnsvtor_get(NRF_UICR_Type const * p_reg)
{
    return p_reg->INITNSVTOR;
}
#endif

#if NRF_UICR_HAS_PTREXT
NRF_STATIC_INLINE uint32_t * nrf_uicr_ptrextuicr_get(NRF_UICR_Type const * p_reg)
{
    return (uint32_t *)p_reg->PTREXTUICR;
}
#endif

#if NRF_UICR_HAS_BOOTCONF

NRF_STATIC_INLINE
void nrf_uicr_boot_region_config_set(NRF_UICR_Type *                       p_reg,
                                     nrf_uicr_boot_region_config_t const * p_config)
{
    p_reg->BOOTCONF = (((p_config->permissions & NRF_UICR_BOOTCONF_PERM_MASK)) |
                       ((p_config->writeonce ? UICR_BOOTCONF_WRITEONCE_Enabled :
                                               UICR_BOOTCONF_WRITEONCE_Disabled)
                        << UICR_BOOTCONF_WRITE_Pos) |
                       ((p_config->lock ? UICR_BOOTCONF_LOCK_Enabled:
                                          UICR_BOOTCONF_LOCK_Disabled) << UICR_BOOTCONF_LOCK_Pos) |
                       ((p_config->size_kb << UICR_BOOTCONF_SIZE_Pos) & UICR_BOOTCONF_SIZE_Msk));
}

NRF_STATIC_INLINE bool nrf_uicr_boot_region_config_get(NRF_UICR_Type const *           p_reg,
                                                       nrf_uicr_boot_region_config_t * p_config)
{
    uint32_t reg = p_reg->BOOTCONF;
    p_config->permissions = reg & NRF_UICR_BOOTCONF_PERM_MASK;
    p_config->writeonce   = ((reg & UICR_BOOTCONF_WRITEONCE_Msk) >> UICR_BOOTCONF_WRITEONCE_Pos) ==
                            UICR_BOOTCONF_WRITEONCE_Enabled;
    p_config->lock        = ((reg & UICR_BOOTCONF_LOCK_Msk) >> UICR_BOOTCONF_LOCK_Pos) ==
                            UICR_BOOTCONF_LOCK_Enabled;
    p_config->size_kb     = (reg & UICR_BOOTCONF_SIZE_Msk) >> UICR_BOOTCONF_SIZE_Pos;
    return (reg != UICR_BOOTCONF_ResetValue);
}
#endif

#if NRF_UICR_HAS_FEATURE_GPIO
NRF_STATIC_INLINE uint32_t nrf_uicr_gpio_instance_get(NRF_UICREXTENDED_Type const * p_reg,
                                                      uint8_t                       index)
{
    NRFX_ASSERT(index < NRF_UICR_GPIO_COUNT);
    return p_reg->GPIO[index].INSTANCE;
}

NRF_STATIC_INLINE uint32_t nrf_uicr_gpio_ctrlsel_get(NRF_UICREXTENDED_Type const * p_reg,
                                                     uint32_t                      pin_number)
{
    uint32_t port = NRF_PIN_NUMBER_TO_PORT(pin_number);
    uint32_t pin  = NRF_PIN_NUMBER_TO_PIN(pin_number);
    NRFX_ASSERT(port < NRF_UICR_GPIO_COUNT);
    return p_reg->GPIO[port].PIN[pin].CTRLSEL;
}
#endif

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif /* NRF_UICR_H_ */
